#include <stdio.h>
#include <math.h>
#include <iostream>
using namespace std;

int main()
{
 // Задання необхідних змінних
 float b, q, n, j, k, answer;
 string useless;
 
 // Виведення тексту на екран
 cout << "Розрахунок n-ного члена геометричної прогресії\n";
 cout << "Зауважте, що n має бути натуральним числом\n\n";
 
 // Отримання необхідних даних
 cout << "Введіть значення першого члена прогресії (b):";
 cin >> b;
 cout << "А зараз введіть значення знаменника прогресії (q):";
 cin >> q;
 cout << "Також нам знадобиться порядковий номер шуканого члена прогресії (n):";
 cin >> n;
 
 // Розрахунки
 j = n - 1;
 k = pow(q, j);
 answer = b*k;
 
 // Виведення результату на екран
 cout << "\nn-ний член дорівнює " << answer;
 // Виведення тексту на екран
 cout << "\n\nРоботу з програмою завершено, для повторного використання перезапустіть її\n";
 cin >> useless;
 
}
