print("Розрахунок n-ного члена геометричної прогресії") #виведення тексту на екран
print("Зауважте, що n має бути натуральним числом\n") #виведення тексту на екран
print("Введіть значення першого члена прогресії (b):") #виведення тексту на екран
b=float(input()) #задаємо змінну b числовим значенням, яке вводить користувач
print("А зараз введіть значення знаменника прогресії (q):") #виведення тексту на екран
q=float(input()) #задаємо змінну q числовим значенням, яке вводить користувач
print("Також нам знадобиться порядковий номер шуканого члена прогресії (n):") #виведення тексту на екран
n=float(input()) #задаємо змінну q числовим значенням, яке вводить користувач
j=n-1 #j - змінна зі значенням степеня, до якого ми маємо піднести q (за формулою)
k=q**j #тут ми підносимо q до степеня, заданого змінною j, і зберігаємо результат в змінній k
answer=b*k #answer - змінна, в якій міститиметься відповідь (за формулою)
print ("n-ний член дорівнює") #виведення тексту на екран
print (answer) #виведення результату (змінної answer) на екран
print ("\nНатисніть enter для завершення програми") #виведення тексту на екран
useless=input() #useless - змінна, ввід значення якої доданий лише для того, щоб термінал не закривався одразу після завершення операції знаходження n-ного члена геометричної прогресії. Після будь-якого введення та/або натиснення enter програма завершить роботу.

